app/controllers/pokecards_controller.rb

SELECT "pokecards".* FROM "pokecards"
---
    def index
        @pokecards = Pokecard.all