app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "bio", "avatar", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        @user = User.create(user_params)

SELECT "decks".* FROM "decks" WHERE "decks"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
    def addCards
        @user = Deck.find_by(user_id: @user.id)