app/controllers/users_controller.rb

SELECT "pokemons".* FROM "pokemons"
---
    def update
        # @user_deck = User.last
        @user_deck.pokemons << Pokemon.all.sample